package com.javarush.test.level03.lesson04.task01;

/* Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012
*/

import javax.xml.soap.SAAJMetaFactory;


public class Solution
{

    public static void main(String[] args)
    {
        String m ="MAY";
        int d=1, y=2012;
        System.out.println(m+" "+d+" "+y);//напишите тут ваш код
        System.out.println();


    }
}
